//==============================================================================
// File Name            : CoreMain.c
// Creator              : 高見 謙介
// Created Date         : 2025年8月6日
// CPU                  : PIC32MX370F512H
// Compiler             : MPLAB XC32 v4.45
// Overview             : 熱式風速計(I2C)+温度計測器(I2C)=UART通信にてPC(VC#)にて受信
// Operating Frequency  : 80Mhz
// 
// ﾋﾟﾝ設定     :
//    RA0 : 温度ｾﾝｻｰ入力
//    RA1 : ｽﾃｰﾀｽLED出力
//    RC0 : UART TX(9600bps)
// 履歴         :
//    [2025/07/18] 初版作成
//    [2025/07/20] 動作ｸﾛｯｸ設計(CPUの最大動作周波数は50MHz(32MIPS)で構築)
//==============================================================================

#ifndef ADC_MCP3425_DRIVER_H
#define ADC_MCP3425_DRIVER_H

    //*****************************************************//
    // Analog to Digital Converter MCP3425制御用
    //*****************************************************//

    // ｽﾚ-ﾌﾞｱﾄﾞﾚｽ+R/Wを定義
    #define MCP3425_WRITE_ADRESS_BYTE   0xD0        // ｱﾄﾞﾚｽﾊﾞｲﾄ(MCP3425ｱﾄﾞﾚｽ(0x68) + 書込みﾋﾞｯﾄ(0x00) = 0xD0)
    #define MCP3425_READ__ADRESS_BYTE   0xD1        // ｱﾄﾞﾚｽﾊﾞｲﾄ(MCP3425ｱﾄﾞﾚｽ(0x68) + 読込みﾋﾞｯﾄ(0x01) = 0xD1)
 
    #define MCP3425_CONFIGURATION_BYTE  0x98        // ｺﾝﾌｨｸﾞﾚ-ｼｮﾝ値(連続･16ﾋﾞｯﾄ･PGAx1)
    //#define MCP3425_CONFIGURATION_BYTE  0x99      // ｺﾝﾌｨｸﾞﾚ-ｼｮﾝ値(連続･16ﾋﾞｯﾄ･PGAx2)

    //*****************************************************//
    // MCP3425ｺﾝﾌｨｸﾞﾚ-ｼｮﾝ設定値
    // bit7     Readyﾋﾞｯﾄ
    // bit6     ﾁｬﾈﾙｾﾚｸﾄﾋﾞｯﾄ(使用しない)
    // bit5
    // bit4     測定ﾓ-ﾄﾞ    1:連続 / 0：ﾜﾝｼｮｯﾄ
    // bit3     分解能      00：12ﾋﾞｯﾄ / 01:14ﾋﾞｯﾄ / 10：16ﾋﾞｯﾄ
    // bit2
    // bit1     PGA利得     00：x1 / 01：x2 / 10：x4 / 11:x8
    // bit0
    //*****************************************************//

    //*****************************************************//
    // MPC3425関数群のﾌﾟﾛﾄﾀｲﾌﾟ宣言
    //*****************************************************//

    void MSSP_MCP3425_Initialize(void);
    
    void MSSP_MCP3425_GetDataProc(unsigned char *upper_data, unsigned char *lower_data);

#endif